Raw-wrk-files/run-3/query/rails-stripped-jruby/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Mon Oct 21 17:33:39 PDT 2013

  System load:  0.06               Processes:           120
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 3%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

64 packages can be updated.
24 updates are security updates.


---------------------------------------------------------
 Running Primer rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=2
---------------------------------------------------------

Running 5s test @ http://tfbapp:8080/rails/hello_world/db?queries=2
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.69ms    1.43ms  17.99ms   93.29%
    Req/Sec   296.14     64.33   454.00     65.24%
  11102 requests in 5.00s, 4.24MB read
Requests/sec:   2219.64
Transfer/sec:    868.28KB

---------------------------------------------------------
 Running Warmup rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=2
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=2
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   135.18ms   50.66ms 285.26ms   65.02%
    Req/Sec   231.82     15.51   310.00     70.00%
  27796 requests in 15.00s, 10.62MB read
Requests/sec:   1852.52
Transfer/sec:    724.65KB

---------------------------------------------------------
 Queries: 1 for rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=1
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=1
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   105.51ms   43.75ms 227.77ms   66.92%
    Req/Sec   294.39     21.37   414.00     69.43%
  35344 requests in 15.01s, 12.43MB read
Requests/sec:   2355.22
Transfer/sec:    848.21KB

---------------------------------------------------------
 Queries: 5 for rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=5
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=5
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   211.92ms   64.41ms 398.32ms   66.98%
    Req/Sec   149.69      8.98   223.00     78.77%
  17908 requests in 15.01s, 8.49MB read
Requests/sec:   1192.97
Transfer/sec:    578.90KB

---------------------------------------------------------
 Queries: 10 for rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=10
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=10
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   330.23ms   80.45ms 628.45ms   68.76%
    Req/Sec    94.43      6.46   121.00     74.75%
  11333 requests in 15.02s, 7.09MB read
Requests/sec:    754.75
Transfer/sec:    483.37KB

---------------------------------------------------------
 Queries: 15 for rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=15
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=15
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   449.59ms  100.59ms 765.19ms   67.52%
    Req/Sec    68.86      4.22    92.00     77.70%
  8247 requests in 15.04s, 6.41MB read
Requests/sec:    548.45
Transfer/sec:    436.35KB

---------------------------------------------------------
 Queries: 20 for rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=20
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=20
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   587.28ms  109.47ms 900.37ms   64.98%
    Req/Sec    53.72      3.39    63.00     68.55%
  6430 requests in 15.04s, 5.97MB read
Requests/sec:    427.54
Transfer/sec:    406.50KB